; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-99)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 car19 car20 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 loc15 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc10)
    (at car1 loc14)
    (at car2 loc13)
    (at car3 loc9)
    (at car4 loc5)
    (at car5 loc1)
    (at car6 loc15)
    (at car7 loc15)
    (at car8 loc15)
    (at car9 loc12)
    (at car10 loc7)
    (at car11 loc11)
    (at car12 loc4)
    (at car13 loc6)
    (at car14 loc14)
    (at car15 loc14)
    (at car16 loc4)
    (at car17 loc2)
    (at car18 loc12)
    (at car19 loc9)
    (at car20 loc3)
)
 (:goal (and 
(at car1 loc3)
(at car2 loc11)
))
)

; plan
1. (sail loc10 loc13)
   deleted: (at-ferry loc10)
   added: (at-ferry loc13)
   goals met: 0 of 2
2. (board car2 loc13)
   deleted: (at car2 loc13) (empty-ferry)
   added: (on car2)
   goals met: 0 of 2
3. (sail loc13 loc11)
   deleted: (at-ferry loc13)
   added: (at-ferry loc11)
   goals met: 0 of 2
4. (debark car2 loc11)
   deleted: (on car2)
   added: (at car2 loc11) (empty-ferry)
   goals met: 1 of 2
5. (sail loc11 loc14)
   deleted: (at-ferry loc11)
   added: (at-ferry loc14)
   goals met: 1 of 2
6. (board car1 loc14)
   deleted: (at car1 loc14) (empty-ferry)
   added: (on car1)
   goals met: 1 of 2
7. (sail loc14 loc3)
   deleted: (at-ferry loc14)
   added: (at-ferry loc3)
   goals met: 1 of 2
8. (debark car1 loc3)
   deleted: (on car1)
   added: (at car1 loc3) (empty-ferry)
   goals met: 2 of 2
